; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_4 ?v5 - type_3 ?v4 - type_1)
 	      (pred_3 ?v7 - object ?v4 - type_1)
	      (pred_1 ?v5 - type_3 ?v1 - type_2)
	      (pred_2 ?v5 - type_3 ?v7 - object ?v1 - type_2))

   (:action op_2
       :parameters  (?v5 - type_3 ?v3 ?v6 - type_1)
       :precondition (and  (pred_4 ?v5 ?v3))
       :effect (and  (pred_4 ?v5 ?v6)
		     (not (pred_4 ?v5 ?v3))))

   (:action op_1
       :parameters (?v5 - type_3 ?v2 - object ?v8 - type_1 ?v1 - type_2)
       :precondition  (and  (pred_3 ?v2 ?v8) (pred_4 ?v5 ?v8) (pred_1 ?v5 ?v1))
       :effect (and (pred_2 ?v5 ?v2 ?v1)
		    (not (pred_3 ?v2 ?v8)) 
		    (not (pred_1 ?v5 ?v1))))

   (:action op_3
       :parameters (?v5 - type_3 ?v2 - object ?v8 - type_1 ?v1 - type_2)
       :precondition  (and  (pred_2 ?v5 ?v2 ?v1) (pred_4 ?v5 ?v8))
       :effect (and (pred_3 ?v2 ?v8)
		    (pred_1 ?v5 ?v1)
		    (not (pred_2 ?v5 ?v2 ?v1)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_08 obj_09 - type_3
obj_05 obj_13 obj_11 obj_07 - type_2
obj_02 obj_10 obj_06 obj_04 - type_1
obj_12 obj_03 obj_01 - object)
(:init
(pred_4 obj_08 obj_04)
(pred_1 obj_08 obj_05)
(pred_1 obj_08 obj_13)
(pred_4 obj_09 obj_02)
(pred_1 obj_09 obj_11)
(pred_1 obj_09 obj_07)
(pred_3 obj_12 obj_06)
(pred_3 obj_03 obj_04)
(pred_3 obj_01 obj_02)
)
(:goal
(and
(pred_3 obj_12 obj_06)
(pred_3 obj_03 obj_06)
(pred_3 obj_01 obj_06)
)
)

(:constraints
  (always (not (pred_4 obj_08 obj_06)))
)
)

; plan
1. (op_1 obj_08 obj_03 obj_04 obj_13)
   deleted: (pred_3 obj_03 obj_04) (pred_1 obj_08 obj_13)
   added: (pred_2 obj_08 obj_03 obj_13)
   goals met: 1 of 3
2. (op_1 obj_09 obj_01 obj_02 obj_07)
   deleted: (pred_3 obj_01 obj_02) (pred_1 obj_09 obj_07)
   added: (pred_2 obj_09 obj_01 obj_07)
   goals met: 1 of 3
3. (op_2 obj_09 obj_02 obj_06)
   deleted: (pred_4 obj_09 obj_02)
   added: (pred_4 obj_09 obj_06)
   goals met: 1 of 3
4. (op_3 obj_09 obj_01 obj_06 obj_07)
   deleted: (pred_2 obj_09 obj_01 obj_07)
   added: (pred_3 obj_01 obj_06) (pred_1 obj_09 obj_07)
   goals met: 2 of 3
5. (op_2 obj_09 obj_06 obj_04)
   deleted: (pred_4 obj_09 obj_06)
   added: (pred_4 obj_09 obj_04)
   goals met: 2 of 3
6. (op_3 obj_08 obj_03 obj_04 obj_13)
   deleted: (pred_2 obj_08 obj_03 obj_13)
   added: (pred_3 obj_03 obj_04) (pred_1 obj_08 obj_13)
   goals met: 2 of 3
7. (op_1 obj_09 obj_03 obj_04 obj_07)
   deleted: (pred_3 obj_03 obj_04) (pred_1 obj_09 obj_07)
   added: (pred_2 obj_09 obj_03 obj_07)
   goals met: 2 of 3
8. (op_2 obj_09 obj_04 obj_06)
   deleted: (pred_4 obj_09 obj_04)
   added: (pred_4 obj_09 obj_06)
   goals met: 2 of 3
9. (op_3 obj_09 obj_03 obj_06 obj_07)
   deleted: (pred_2 obj_09 obj_03 obj_07)
   added: (pred_3 obj_03 obj_06) (pred_1 obj_09 obj_07)
   goals met: 3 of 3
